#!/usr/bin/env python3
"""
    Asset colors dictionary, in (R, G, B) format, scaled to float 1.0
"""

RGB_COLOR_MAP = {
    'Акции РФ':                    (1.0, 0.0, 0.0),  # red
    'Гос. облигации РФ':           (0.0, 0.0, 1.0),  # blue
    'ОПИФ российских облигаций':   (0.0, 0.0, 1.0),  # blue
    'Депозиты в РФ (до года)':     (1.0, 0.0, 1.0),  # cyan
    'Доллар США':                  (0.0, 0.5, 0.0),  # green
    'Золото':                      (1.0, 1.0, 0.0),  # yellow
    'Серебро':                     (0.0, 1.0, 1.0),  # cyan
}
